countries_dictc = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин","Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам", "Франция": "Париж",
                   "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана",
                   "Босния и Герцеговина": "Сараево","Северная Македония": "Скопье", "Сербия": "Белград"}
print(countries_dictc)
st = input('Выберите страну ')
print(countries_dictc[st])
for key in sorted(countries_dictc):
    print(key, " - ", countries_dictc[key])
def n1():
    w = input("Введите ваше слово ")
    s = 0
    alph = {
        "a": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 3,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }
    for i in w:
        s += alph[i.lower()]
        print('Сумма', s)
n1()
def n2():
    stud = {"Петров": "английский, русский", "Васильев": "французский, русский, немецкий", "Саблин": "французский, русский",
            "Михайлов": "немецкий, русский, китайский", "Васечкин": "китайский, русский, итальянский", "Смирнов": "русский, английский, турецкий"}
    kolich=0
    sum=0
    spi=''
    a=''
    for key in stud:
        if "китайский" in stud[key]:
            kolich+=1
        a += ',' + stud[key]
    print("Студентов, знающих китайский ", kolich)
    d = a.split(",")
    d = sorted(d)
    for i in d:
        if i not in spi:
            spi += i + ' '
            sum += 1
    print("Список языков, которые знают студенты ", spi)
    print("Количество языков, которыне знают студенты ", sum)
n2()